# DimWitnsLineCntrl Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..DimWitnsLineCntrl Property
ParameterTypeId Class See Also
---
"Witness Line Control"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId DimWitnsLineCntrl { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DimWitnsLineCntrl As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ DimWitnsLineCntrl {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace